#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииПараметраОтбора(Элемент)
	
	Если Элемент.Имя = "НачалоПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.НачалоПериода);
	ИначеЕсли Элемент.Имя = "КонецПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.КонецПериода);
	ИначеЕсли Элемент.Имя = "Валюта" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.Валюта);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбора(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораВалют = ПолучитьФорму("Справочник.Валюты.ФормаВыбора", Новый Структура("НеПоказыватьОсновнуюВалютуУчета", Истина));
	
	РезультатВыбора = ФормаВыбораВалют.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда
		Отчет.Валюта = РезультатВыбора;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ВалютаНачалоВыбора(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ВалютаНачалоВыбора(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрОтбора(Имя, Значение)
	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(Имя, Значение);
	
КонецПроцедуры

#КонецОбласти







