
#Область ПрограммныйИнтерфейс

Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	
	// TODO - доделать полную реализацию метода
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

Процедура УстановитьПараметрДанных(КоллецияПараметров, ИмяПараметра, Значение) Экспорт
	
	Параметр = КоллецияПараметров.Элементы.Найти(ИмяПараметра);
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
