
&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыписку(Команда)
	
	ПараметрыФормы = Новый Структура("Счет", Счет);
	ОткрытьФорму("ОбщаяФормы.ЗагрузкаВыпискиБанка", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БанковскаяТранзакция.Дата,
	|	БанковскаяТранзакция.Ссылка,
	|	БанковскаяТранзакция.Валюта,
	|	БанковскаяТранзакция.ВидДвижения,
	|	БанковскаяТранзакция.Содержание,
	|	БанковскаяТранзакция.Сумма
	|ПОМЕСТИТЬ Транзакции
	|ИЗ
	|	Документ.БанковскаяТранзакция КАК БанковскаяТранзакция
	|ГДЕ
	|	БанковскаяТранзакция.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И БанковскаяТранзакция.Счет = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходДенежныхСредств.Дата,
	|	РасходДенежныхСредств.ПометкаУдаления,
	|	РасходДенежныхСредств.Проведен,
	|	РасходДенежныхСредств.Ссылка,
	|	РасходДенежныхСредств.СтатьяДДС,
	|	РасходДенежныхСредств.Валюта,
	|	РасходДенежныхСредств.Сумма,
	|	РасходДенежныхСредств.Курс,
	|	РасходДенежныхСредств.Кратность,
	|	РасходДенежныхСредств.Комментарий,
	|	РасходДенежныхСредств.БанковскаяТранзакция,
	|	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДС.Расход) Как ВидДвижения
	|Поместить СуществующиеДокументы
	|ИЗ
	|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
	|ГДЕ
	|	РасходДенежныхСредств.Счет = &Счет
	|	И РасходДенежныхСредств.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходДенежныхСредств.Дата,
	|	ПриходДенежныхСредств.ПометкаУдаления,
	|	ПриходДенежныхСредств.Проведен,
	|	ПриходДенежныхСредств.Ссылка,
	|	ПриходДенежныхСредств.СтатьяДДС,
	|	ПриходДенежныхСредств.Валюта,
	|	ПриходДенежныхСредств.Сумма,
	|	ПриходДенежныхСредств.Курс,
	|	ПриходДенежныхСредств.Кратность,
	|	ПриходДенежныхСредств.Комментарий,
	|	ПриходДенежныхСредств.БанковскаяТранзакция,
	|	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДС.Доход)
	|ИЗ
	|	Документ.ПриходДенежныхСредств КАК ПриходДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Транзакции.Дата,
	|	Ложь Как ПометкаУдаления,
	|	Ложь Как Проведен,
	|	Неопределено Как Документ,
	|	Неопределено Как Статья,
	|	Транзакции.Валюта,
	|	Транзакции.Сумма,
	|	1,
	|	1,
	|	Транзакции.Содержание Как Комментарий,
	|	Транзакции.Ссылка Как БанковскаяТранзакция,
	|	Транзакции.ВидДвижения,
	|	Транзакции.Дата Как ДатаТранзакции
	|ИЗ
	|	Транзакции КАК Транзакции
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеДокументы КАК СуществующиеДокументы
	|		ПО Транзакции.Ссылка = СуществующиеДокументы.БанковскаяТранзакция
	|ГДЕ
	|	СуществующиеДокументы.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СуществующиеДокументы.Дата,
	|	СуществующиеДокументы.ПометкаУдаления,
	|	СуществующиеДокументы.Проведен,
	|	СуществующиеДокументы.Ссылка,
	|	СуществующиеДокументы.СтатьяДДС,
	|	СуществующиеДокументы.Валюта,
	|	СуществующиеДокументы.Сумма,
	|	СуществующиеДокументы.Курс,
	|	СуществующиеДокументы.Кратность,
	|	СуществующиеДокументы.Комментарий,
	|	СуществующиеДокументы.БанковскаяТранзакция,
	|	СуществующиеДокументы.ВидДвижения,
	|	ЕстьNull(Транзакции.Дата, СуществующиеДокументы.Дата)
	|ИЗ
	|	СуществующиеДокументы КАК СуществующиеДокументы
	|		ЛЕВОЕ соединение Транзакции
	|		По СуществующиеДокументы.БанковскаяТранзакция = Транзакции.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаТранзакции";
	Запрос.УстановитьПараметр("Счет", 				Счет);
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	ОкончаниеПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДеревоДокументов.ПолучитьЭлементы().Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Ветвь = ДеревоДокументов.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Ветвь, Выборка);
		
	КонецЦикла;	
	
КонецПроцедуры	
