#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция КурсВалюты(Валюта, Знач Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	ПараметрыКурса = Новый Структура("Курс,Кратность,КурсККратности", 1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурсов, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("ДатаКурсов", 	Период);
	Запрос.УстановитьПараметр("Валюта", 		Валюта);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ПараметрыКурса, Выборка);
		ПараметрыКурса.КурсККратности = Выборка.Курс / Выборка.Кратность;
		
	КонецЕсли;		

	Возврат ПараметрыКурса;
	
КонецФункции

#КонецОбласти	

#КонецЕсли